{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "note_input",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            30,
            128
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "note_input"
        },
        "inbound_nodes": []
      },
      {
        "name": "length_input",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            30,
            141
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "length_input"
        },
        "inbound_nodes": []
      },
      {
        "name": "bidirectional_1",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_1",
          "trainable": true,
          "layer": {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            }
          },
          "merge_mode": "concat"
        },
        "inbound_nodes": [
          [
            [
              "note_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "bidirectional_2",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_2",
          "trainable": true,
          "layer": {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_2",
              "trainable": true,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            }
          },
          "merge_mode": "concat"
        },
        "inbound_nodes": [
          [
            [
              "length_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_1",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "rate": 0.6,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "bidirectional_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_2",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "rate": 0.6,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "bidirectional_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "bidirectional_3",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_3",
          "trainable": true,
          "layer": {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_3",
              "trainable": true,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            }
          },
          "merge_mode": "concat"
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_6",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_6",
          "trainable": true,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 64,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "bidirectional_4",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_4",
          "trainable": true,
          "layer": {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_5",
              "trainable": true,
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            }
          },
          "merge_mode": "concat"
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_4",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_4",
          "trainable": true,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 64,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_1",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_1",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "bidirectional_3",
              0,
              0,
              {}
            ],
            [
              "lstm_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_2",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_2",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "bidirectional_4",
              0,
              0,
              {}
            ],
            [
              "lstm_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_7",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_7",
          "trainable": true,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_8",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_8",
          "trainable": true,
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "concatenate_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_3",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "rate": 0.6,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_4",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "rate": 0.6,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_9",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_9",
          "trainable": true,
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_10",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_10",
          "trainable": true,
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "hard_sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 1
        },
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "note_output",
        "class_name": "Dense",
        "config": {
          "name": "note_output",
          "trainable": true,
          "units": 128,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "length_output",
        "class_name": "Dense",
        "config": {
          "name": "length_output",
          "trainable": true,
          "units": 141,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_10",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "note_input",
        0,
        0
      ],
      [
        "length_input",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "note_output",
        0,
        0
      ],
      [
        "length_output",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.1.3",
  "backend": "tensorflow"
}
