{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 2], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\bsplitter\u0002\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\u000bsplit_shape\u000b\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\bsplitter\u0002\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\u000bsplit_shape\u000b\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\bsplitter\u0002\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\u000bsplit_shape\u000b\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\bsplitter\u0002\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-89021900a739>\u00da\u000bsplit_shape\u000b\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lstm_35", "class_name": "LSTM", "config": {"name": "lstm_35", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "lstm_37", "class_name": "LSTM", "config": {"name": "lstm_37", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_18", 0, 0, {}]]]}, {"name": "lstm_39", "class_name": "LSTM", "config": {"name": "lstm_39", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "lstm_41", "class_name": "LSTM", "config": {"name": "lstm_41", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_20", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_35", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_37", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_39", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_41", 0, 0, {}]]]}, {"name": "dropout_17", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "dropout_18", "class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "lstm_36", "class_name": "LSTM", "config": {"name": "lstm_36", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"name": "lstm_38", "class_name": "LSTM", "config": {"name": "lstm_38", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"name": "lstm_40", "class_name": "LSTM", "config": {"name": "lstm_40", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "lstm_42", "class_name": "LSTM", "config": {"name": "lstm_42", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_36", 0, 0, {}], ["lstm_38", 0, 0, {}], ["lstm_40", 0, 0, {}], ["lstm_42", 0, 0, {}]]]}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "lstm_43", "class_name": "LSTM", "config": {"name": "lstm_43", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"name": "output_notes", "class_name": "Dense", "config": {"name": "output_notes", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_43", 0, 0, {}]]]}, {"name": "output_volume", "class_name": "Dense", "config": {"name": "output_volume", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_43", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output_notes", 0, 0], ["output_volume", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}