{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 2], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\bsplitter\u0001\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\u000bsplit_shape\n\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\bsplitter\u0001\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\u000bsplit_shape\n\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\bsplitter\u0001\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\u000bsplit_shape\n\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000t\u0000j\u0001d\u0001\u0019\u0000}\u0001t\u0002t\u0003t\u0004\u001b\u0000\u0083\u0001}\u0002t\u0002|\u0001|\u0002\u0014\u0000\u0083\u0001}\u0003t\u0002|\u0001d\u0002\u0017\u0000|\u0002\u0014\u0000\u0083\u0001}\u0004|\u0000d\u0000d\u0000\u0085\u0002|\u0003|\u0004\u0085\u0002f\u0002\u0019\u0000}\u0000t\u0005|\u0003|\u0004\u0083\u0002\u0001\u0000|\u0000S\u0000)\u0003N\u00da\u0003num\u00e9\u0001\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0006params\u00da\u0003int\u00da\u0007n_hours\u00da\u000bn_divisions\u00da\u0005print)\u0005\u00da\u0001xr\u0001\u0000\u0000\u0000\u00da\u0005steps\u00da\u0005start\u00da\u0003end\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\bsplitter\u0001\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\n\u0001\f\u0001\f\u0001\u0010\u0001\u0014\u0001\n\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001e\u0000\u0000\u0000|\u0000d\u0001\u0019\u0000t\u0000|\u0000d\u0002\u0019\u0000t\u0001\u001b\u0000\u0083\u0001|\u0000d\u0003\u0019\u0000f\u0003S\u0000)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0003int\u00da\u000bn_divisions)\u0001\u00da\u000binput_shape\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8df296a408c4>\u00da\u000bsplit_shape\n\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "lstm_5", "class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "lstm_7", "class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lstm_7", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 4, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "lstm_4", "class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 4, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "lstm_6", "class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 4, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "lstm_8", "class_name": "LSTM", "config": {"name": "lstm_8", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 4, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_4", 0, 0, {}], ["lstm_6", 0, 0, {}], ["lstm_8", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "lstm_9", "class_name": "LSTM", "config": {"name": "lstm_9", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "output_notes", "class_name": "Dense", "config": {"name": "output_notes", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_9", 0, 0, {}]]]}, {"name": "output_volume", "class_name": "Dense", "config": {"name": "output_volume", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_9", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output_notes", 0, 0], ["output_volume", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}